emacs.org
#+setupfile: ./site.template
#+title: My Emacs configuration
#+date: <2020-10-31>
#+author: MinasMazar
#+email: minasmazar@gmail.com
#+property: header-args :comments yes

* Introduction
** Purposes
This is intended to be a really basic Emacs configuration. The main
features of this configuration are:

** KISS

Do not include all the super fancy featured packages for IDE or
OS-like extension of Emacs, but keep it simple, stupid and thin as
possible. It should work as a vanilla Emacs distribution, so trying
not to remap main keybindings, but adding a little set of important
keychords. This means no Evil mode, but God mode ([[http://tobytripp.github.io/emacs.d/god.html][here's a god article]]). I somethime miss the mighty [[https://www.vim.org/][vim]] edit mode, so feel free to activate [[https://github.com/emacs-evil/evil#start-of-content][evil-mode]].

** TODO Literate configuration

Basically, what you're reading now is the Emacs configuration: it is
an [[org-mode]] file which will be tangled via [[https://orgmode.org/features.html#babel][Org abel]]
(~org-babel-load-file~). You only have to copy/paste [[Init.el][init.el]].

... also take a look to ~#+PROPERTY: header-args :comments yes~ in the headers of this file!

** Out-of-the-box

It should be downloaded with CLI tools (like wget, curl), and the only additional operation required in order to let it work is the
extraction of the literate part into a dedicated `init.el`. This also
means, in some way, that it will be lightweight as possible. If you
want to add a particular set of configuration and packages, in order
to transform your Emacs into a wonderful IDE on just the unbeatable OS you've ever seen, you can [[Conventions][uncomment]] some blocks you will find along the way.

*** Init.el

In order to load this literate configuration file, your ~init.el~ should be something like the next code block. The code is can be [[https://orgmode.org/manual/Exporting-Code-Blocks.html][exported]] into the standard [[file:~/.emacs.d/init.el][init.el]] by simply evaluating the code itself with ~(org-ctrl-c-ctrl-c)~ or by pressing.. - guess what? ;)

#+begin_src emacs-lisp :tangle no :exports ~/.emacs.d/init.el :output 
(require 'package)

(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

; For important compatibility libraries like cl-lib
(when (< emacs-major-version 24)
  (add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/")))

(package-initialize)
(require 'use-package)
(use-package org
  :config
  (org-babel-load-file "~/.emacs.d/emacs.org"))
#+end_src

** Versionable

This file is intended to be in the root of a ~dotfiles~ like repo. For this reason some files are [[file:.gitignore][ignored]].

** Bloggable

It should contain all the informations, snippets and out-of-the-box
  shell code blocks in order to have an usable, self-documented,
  Emacs-centric blog. ;) We will take advantage of the [[https://orgmode.org/manual/Publishing.html][publishing
  feature]] of [[org-mode][org-mode]].

** Conventions

Somewhere in this configuration file you can find "uncomment the code
block". This usually means to remove =COMMENT= on heading, turn an *ORG* code block from [[https://orgmode.org/manual/Literal-Examples.html#Literal-Examples][~+begin_example~]] to [[https://orgmode.org/manual/Working-with-Source-Code.html#Working-with-Source-Code][~+begin_src~]], or to remove the ~:tangle no~ attribute.

Maybe is not a best practice for security reasons, but somewhere in
this document you can find [[https://orgmode.org/guide/Hyperlinks.html][org-links]] to elisp code which will run
elisp code on the fly, in order to quickly jump somewhere or make
something happens in your emacs (very useful for demontration
purposes), but *is very risky*.  *Ensure
~org-link-elisp-confirm-function~ is nil*; this way you will be asked
for confirmation and here you will see the command displayed in the
minibuffer.

*Anyway I can’t accept any responsibility or liability for
damages arising from evaluating untrusted lisp code on your machine.*

* Main configurations

These are some really basic customizations.

#+begin_src emacs-lisp
  (setq ring-bell-function 'ignore)
  (setq make-backup-files nil)
  (setq use-package-always-ensure t)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src

** exec-path and PATH env
   
Append ~usr/local/bin~ to the ~PATH~

#+begin_src emacs-lisp
(push "/usr/local/bin" exec-path)
(push "~/.asdf/shims" exec-path)
(setenv "PATH" (string-join exec-path ":"))
#+end_src

** Additional (disabled) configuration

This is an example of other common variables you could wish having in place.

#+begin_example emacs-lisp
(custom-set-variables
  '(tab-always-indent 'complete)
  '(web-mode-code-indent-offset 2)
  '(web-mode-css-indent-offset 2)
  '(web-mode-markup-indent-offset 2))
#+end_example

** Buffer predicates

#+begin_src emacs-lisp
(defun no-helm-buffer-predicate (buffer)
  (if (string-match "helm" (buffer-name buffer))
      nil
    t))

(setq buffer-predicate 'no-helm-buffer-predicate)
#+end_src

** Main packages
*** COMMENT Projectile

#+begin_src emacs-lisp
  (use-package projectile
    :bind
    ("C-x p f" . projectile-find-file)
    ("C-x p b" . projectile-switch-to-buffer)
    ("C-x p s" . projectile-ripgrep)
    ("s-P" . projectile-find-file)
    ("s-{" . projectile-previous-project-buffer)
    ("s-}" . projectile-next-project-buffer))
#+end_src

** Eshell
   #+begin_src emacs-lisp
     (use-package eshell
       :custom
       (eshell-scroll-to-bottom-on-input 'all)
       (eshell-destroy-buffer-when-process-dies t)
       (eshell-env-path (getenv "PATH")))
   #+end_src

   Eshell aliases goes under ~~/.emacs.d/eshell/aliases~ as default. You can customize it with sometihg like that:

   #+begin_example emacs-lisp
   alias ff "find-file $*"
   alias rr "ripgrep-regexp . $1"
   #+end_example
