emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-05 Sat 00:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="MinasMazar" />
<link rel="stylesheet" type="text/css" href="assets/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">My Emacs configuration</h1>

<div id="outline-container-orgcaedf52" class="outline-2">
<h2 id="orgcaedf52"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2e6c363" class="outline-3">
<h3 id="org2e6c363"><span class="section-number-3">1.1</span> Purposes</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This is intended to be a really basic Emacs configuration. The main
features of this configuration are:
</p>
</div>
</div>

<div id="outline-container-orgbf78212" class="outline-3">
<h3 id="orgbf78212"><span class="section-number-3">1.2</span> KISS</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Do not include all the super fancy featured packages for IDE or
OS-like extension of Emacs, but keep it simple, stupid and thin as
possible. It should work as a vanilla Emacs distribution, so trying
not to remap main keybindings, but adding a little set of important
keychords. This means no Evil mode, but God mode (<a href="http://tobytripp.github.io/emacs.d/god.html">here's a god article</a>). I somethime miss the mighty <a href="https://www.vim.org/">vim</a> edit mode, so feel free to activate <a href="https://github.com/emacs-evil/evil#start-of-content">evil-mode</a>.
</p>
</div>
</div>

<div id="outline-container-org76f683f" class="outline-3">
<h3 id="org76f683f"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> Literate configuration</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Basically, what you're reading now is the Emacs configuration: it is
an <a href="#org9797417">6</a> file which will be tangled via <a href="https://orgmode.org/features.html#babel">Org abel</a>
(<code>org-babel-load-file</code>). You only have to copy/paste <a href="#org091236a">init.el</a>.
</p>

<p>
&#x2026; also take a look to <code>#+PROPERTY: header-args :comments yes</code> in the headers of this file!
</p>
</div>
</div>

<div id="outline-container-org34e720c" class="outline-3">
<h3 id="org34e720c"><span class="section-number-3">1.4</span> Out-of-the-box</h3>
<div class="outline-text-3" id="text-1-4">
<p>
It should be downloaded with CLI tools (like wget, curl), and the only additional operation required in order to let it work is the
extraction of the literate part into a dedicated `init.el`. This also
means, in some way, that it will be lightweight as possible. If you
want to add a particular set of configuration and packages, in order
to transform your Emacs into a wonderful IDE on just the unbeatable OS you've ever seen, you can <a href="#org529d43d">uncomment</a> some blocks you will find along the way.
</p>
</div>

<div id="outline-container-org091236a" class="outline-4">
<h4 id="org091236a"><span class="section-number-4">1.4.1</span> Init.el</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
In order to load this literate configuration file, your <code>init.el</code> should be something like the next code block. The code is can be <a href="https://orgmode.org/manual/Exporting-Code-Blocks.html">exported</a> into the standard <a href="file:///Users/invisigoth/.emacs.d/init.el">init.el</a> by simply evaluating the code itself with <code>(org-ctrl-c-ctrl-c)</code> or by pressing.. - guess what? ;)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'package)

(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

; For important compatibility libraries like cl-lib
(when (&lt; emacs-major-version 24)
  (add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/")))

(package-initialize)
(require 'use-package)
(use-package org
  :config
  (org-babel-load-file "~/.emacs.d/emacs.org"))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc6df9a5" class="outline-3">
<h3 id="orgc6df9a5"><span class="section-number-3">1.5</span> Versionable</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This file is intended to be in the root of a <code>dotfiles</code> like repo. For this reason some files are <a href=".gitignore">ignored</a>.
</p>
</div>
</div>

<div id="outline-container-org6a43260" class="outline-3">
<h3 id="org6a43260"><span class="section-number-3">1.6</span> Bloggable</h3>
<div class="outline-text-3" id="text-1-6">
<p>
It should contain all the informations, snippets and out-of-the-box
  shell code blocks in order to have an usable, self-documented,
  Emacs-centric blog. ;) We will take advantage of the <a href="https://orgmode.org/manual/Publishing.html">publishing
  feature</a> of <a href="#org9797417">org-mode</a>.
</p>
</div>
</div>

<div id="outline-container-org529d43d" class="outline-3">
<h3 id="org529d43d"><span class="section-number-3">1.7</span> Conventions</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Somewhere in this configuration file you can find "uncomment the code
block". This usually means to remove <code>COMMENT</code> on heading, turn an <b>ORG</b> code block from <a href="https://orgmode.org/manual/Literal-Examples.html#Literal-Examples"><code>+begin_example</code></a> to <a href="https://orgmode.org/manual/Working-with-Source-Code.html#Working-with-Source-Code"><code>+begin_src</code></a>, or to remove the <code>:tangle no</code> attribute.
</p>

<p>
Maybe is not a best practice for security reasons, but somewhere in
this document you can find <a href="https://orgmode.org/guide/Hyperlinks.html">org-links</a> to elisp code which will run
elisp code on the fly, in order to quickly jump somewhere or make
something happens in your emacs (very useful for demontration
purposes), but <b>is very risky</b>.  <b>Ensure
<code>org-link-elisp-confirm-function</code> is nil</b>; this way you will be asked
for confirmation and here you will see the command displayed in the
minibuffer.
</p>

<p>
<b>Anyway I can’t accept any responsibility or liability for
damages arising from evaluating untrusted lisp code on your machine.</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org31b2c63" class="outline-2">
<h2 id="org31b2c63"><span class="section-number-2">2</span> Main configurations</h2>
<div class="outline-text-2" id="text-2">
<p>
These are some really basic customizations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq ring-bell-function 'ignore)
(setq make-backup-files nil)
(setq use-package-always-ensure t)
(tool-bar-mode -1)
(scroll-bar-mode -1)
</pre>
</div>
</div>

<div id="outline-container-org170467f" class="outline-3">
<h3 id="org170467f"><span class="section-number-3">2.1</span> exec-path and PATH env</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Append <code>usr/local/bin</code> to the <code>PATH</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(push "/usr/local/bin" exec-path)
(push "~/.asdf/shims" exec-path)
(setenv "PATH" (string-join exec-path ":"))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf98d439" class="outline-3">
<h3 id="orgf98d439"><span class="section-number-3">2.2</span> Additional (disabled) configuration</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This is an example of other common variables you could wish having in place.
</p>

<pre class="example" id="org13ce58d">
(custom-set-variables
  '(tab-always-indent 'complete)
  '(web-mode-code-indent-offset 2)
  '(web-mode-css-indent-offset 2)
  '(web-mode-markup-indent-offset 2))
</pre>
</div>
</div>

<div id="outline-container-org31f8006" class="outline-3">
<h3 id="org31f8006"><span class="section-number-3">2.3</span> Buffer predicates</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun no-helm-buffer-predicate (buffer)
  (if (string-match "helm" (buffer-name buffer))
      nil
    t))

(setq buffer-predicate 'no-helm-buffer-predicate)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d40205" class="outline-3">
<h3 id="org8d40205"><span class="section-number-3">2.4</span> Main packages</h3>
</div>
<div id="outline-container-orgf1fd25e" class="outline-3">
<h3 id="orgf1fd25e"><span class="section-number-3">2.5</span> Eshell</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package eshell
  :custom
  (eshell-scroll-to-bottom-on-input 'all)
  (eshell-destroy-buffer-when-process-dies t)
  (eshell-env-path (getenv "PATH")))
</pre>
</div>

<p>
Eshell aliases goes under <code>~/.emacs.d/eshell/aliases</code> as default. You can customize it with sometihg like that:
</p>

<pre class="example" id="orgaf97346">
alias ff "find-file $*"
alias rr "ripgrep-regexp . $1"
</pre>
</div>
</div>
