emacs.org
** Shell commands

   Has mentioned [[https://emacs.stackexchange.com/questions/10570/executing-commands-through-shell-command-what-is-the-path-used][in this stackexchange thread]]..

#+begin_quote
when running M-x shell but not when running M-! / (shell-command), as there is no prompt. You can adjust the option flags that are sent to (shell-command) by adjusting shell-command-switch to instruct it to act interactively and load your shell dotfile with:
#+end_quote

#+begin_src emacs-lisp
(setq shell-command-switch "-ic")
#+end_src

** Exwm
   Emacs window manager sample configuration to put somewhere into your ~init.el~. 
   #+begin_example emacs-lisp
     (use-package exwm
       :config
       (menu-bar-mode -1)
       (tool-bar-mode -1)
       (scroll-bar-mode -1)
       ;; Also shrink fringes to 1 pixel.
       (fringe-mode 1)
       ;; Turn on `display-time-mode' if you don't use an external bar.
       (display-time-default-load-average nil)
       (display-time-mode t)
       (server-start)
       ;; Set the initial number of workspaces (they can also be created later).
       (setq exwm-workspace-number 4)
       ;; Fix problems with Ido (if you use it).
       ;;(require 'exwm-config)
       ;;(exwm-config-ido)
       )
   #+end_example

This is an example configuration to add into you ~~/.xinitrc~

#+begin_example
# You may need to comment out the next line to disable access control.
#xhost +SI:localuser:$USER

# Set themes, etc.
gnome-settings-daemon &

# Set fallback cursor.
xsetroot -cursor_name left_ptr

# Set keyboard repeat rate.
xset r rate 200 60

# If Emacs is started in server mode, `emacsclient` is a convenient way to
# edit files in place (used by e.g. `git commit`).
export VISUAL=emacsclient
export EDITOR="$VISUAL"

# Finally launch emacs.
exec dbus-launch --exit-with-session emacs
#+end_example
* Keybindings

These are my preferred keybindings

#+begin_src emacs-lisp
    (global-set-key (kbd "C-x C-F") 'find-file-at-point)
    (global-set-key (kbd "C-x p p") 'project-switch-open-project)
    (global-set-key (kbd "C-x p f") 'project-find-file)
    (global-set-key (kbd "C-x p b") 'project-switch-to-buffer)
    (global-set-key (kbd "C-x p k") 'project-kill-buffers)

    (defcustom mm/meta-prefix "C-." "mm/meta prefix")
    (global-set-key (kbd mm/meta-prefix) nil)
    (defun mm/meta-set-key (keystroke)
      "Set keystroke mm prefixed"
      (kbd (concat mm/meta-prefix " " keystroke)))

    (global-set-key (mm/meta-set-key "b") 'ibuffer)
    (global-set-key (mm/meta-set-key "h") '(lambda () (interactive)
                                             (find-file "~/.emacs.d/emacs.org")))
    (global-set-key (mm/meta-set-key "i m") 'imenu)
    (global-set-key (mm/meta-set-key "i b") 'ibuffer)
    (global-set-key (mm/meta-set-key "o a") 'org-agenda)
    (global-set-key (mm/meta-set-key "o c") 'org-capture)
    (global-set-key (mm/meta-set-key "e s") 'sh-send-line-or-region-and-step)
    (global-set-key (mm/meta-set-key "e e") 'eshell)
    (global-set-key (mm/meta-set-key "w") 'eww)
#+end_src

** Meta-key
Wants to take advantage of the meta key (i.e. ~CMD~ on MacOS, or
~Win~ on Windows) to set some useful shortcuts, [[KISS][trying to preserve the vanilla emacs muscle memory]]. So ~s-0~ for ~C-x 0~, ~s-3~ for ~C-x 3~ and so on..

#+begin_src emacs-lisp
  (global-set-key (kbd "s-c") 'kill-ring-save)
  (global-set-key (kbd "s-1") 'delete-other-windows)
  (global-set-key (kbd "s-3") 'split-window-horizontally)
  (global-set-key (kbd "s-2") 'split-window-vertically)
  (global-set-key (kbd "s-0") 'delete-window)
  (global-set-key (kbd "s-w") 'other-window)
  (global-set-key (kbd "s-W") '(lambda () (interactive)
                                 (other-window 1) (maximize-window)))
  (global-set-key (kbd "s-r") 'repeat)
  (global-set-key (kbd "s-K") 'switch-to-buffer)
  (global-set-key (kbd "s-p") 'project-switch-to-buffer)
  (global-set-key (kbd "s-P") 'project-find-file)
  (global-set-key (kbd "s-t") 'eshell)
  (global-set-key (kbd "s-[") 'previous-buffer)
  (global-set-key (kbd "s-]") 'next-buffer)
  (global-set-key (kbd "s--") 'bookmark-bmenu-list)
  (global-set-key (kbd "s-_") 'bookmark-set)
  (global-set-key (kbd "s-\\") 'other-frame)
  (global-set-key (kbd "s-N") 'dired-jump)
  (global-set-key (kbd "s-DEL") 'zap-up-to-char)
  (global-set-key (kbd "s-=") 'balance-windows)
  (global-set-key (kbd "s-)") 'kill-this-buffer)
#+end_src

Override ~isearch-mode-map~

#+begin_src emacs-lisp
  (define-key isearch-mode-map (kbd "C-p") 'isearch-repeat-backward)
  (define-key isearch-mode-map (kbd "C-n") 'isearch-repeat-forward)
  (define-key isearch-mode-map (kbd "<tab>") 'isearch-repeat-backward)
  (define-key isearch-mode-map (kbd "<S-tab>") 'isearch-repeat-forward)
#+end_src

Add shortcut in translation map which basically are fast access to ~C-x~ and ~C-c~.

#+begin_src emacs-lisp
  (define-key key-translation-map (kbd "s-k") (kbd "M-x"))
  (define-key key-translation-map (kbd "s-m") (kbd "C-x"))
  (define-key key-translation-map (kbd "s-M") (kbd "C-c"))
  (define-key key-translation-map (kbd "s-o") (kbd mm/meta-prefix))
#+end_src

* No meta (alt)?

   For some reason you can't use the ~alt~ key on your keyboard? (It happens to me with Iterm + ssh + emacsclient session) and for some reason you don't want to solve this issue configuring Iterm or else? In this case you use this workaround, remapping some core keybinding like ~C-k~ and ~C-l~.

#+begin_example emacs-lisp
  (global-set-key (kbd "C-k") 'execute-extended-command)
  (global-set-key (kbd "C-K") 'kill-visual-line)
  (global-set-key (kbd "C-l") 'god-local-mode)
  (global-set-key (kbd "C-L") 'recenter-top-bottom)
#+end_example
** Editing

#+begin_src emacs-lisp
  (global-set-key (kbd "C-; C-k") 'zap-up-to-char)
  (global-set-key (kbd "C-; C-;") 'dabbrev-expand)
#+end_src

** Autocompletion
*** Company

 A basic auto-completion package.

 #+begin_src emacs-lisp
 (use-package company
   :config
   (global-company-mode))
 #+end_src

** Highlight and markers

#+begin_src emacs-lisp
  (show-paren-mode t)
#+end_src

** Parenthesis

#+begin_src emacs-lisp
(use-package rainbow-mode)
#+end_src
** Expand region
#+begin_src emacs-lisp
  (use-package expand-region
    :bind
    ("s-l" . er/expand-region))
#+end_src

Used in tandem with

#+begin_src emacs-lisp
(pending-delete-mode t)
#+end_src
** Navigation
*** Jumping around
#+begin_src emacs-lisp
  (use-package ace-jump-mode
    :config
    (global-set-key (kbd "s-j") 'ace-jump-word-mode))
#+end_src
