emacs.html
<div id="outline-container-org886d43e" class="outline-3">
<h3 id="org886d43e"><span class="section-number-3">2.6</span> Shell commands</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Has mentioned <a href="https://emacs.stackexchange.com/questions/10570/executing-commands-through-shell-command-what-is-the-path-used">in this stackexchange thread</a>..
</p>

<blockquote>
<p>
when running M-x shell but not when running M-! / (shell-command), as there is no prompt. You can adjust the option flags that are sent to (shell-command) by adjusting shell-command-switch to instruct it to act interactively and load your shell dotfile with:
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq shell-command-switch "-ic")
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c3265d" class="outline-3">
<h3 id="org1c3265d"><span class="section-number-3">2.7</span> Exwm</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Emacs window manager sample configuration to put somewhere into your <code>init.el</code>. 
</p>
<pre class="example" id="orga3836fb">
(use-package exwm
  :config
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  ;; Also shrink fringes to 1 pixel.
  (fringe-mode 1)
  ;; Turn on `display-time-mode' if you don't use an external bar.
  (display-time-default-load-average nil)
  (display-time-mode t)
  (server-start)
  ;; Set the initial number of workspaces (they can also be created later).
  (setq exwm-workspace-number 4)
  ;; Fix problems with Ido (if you use it).
  ;;(require 'exwm-config)
  ;;(exwm-config-ido)
  )
</pre>

<p>
This is an example configuration to add into you <code>~/.xinitrc</code>
</p>

<pre class="example" id="org2317a71">
# You may need to comment out the next line to disable access control.
#xhost +SI:localuser:$USER

# Set themes, etc.
gnome-settings-daemon &amp;

# Set fallback cursor.
xsetroot -cursor_name left_ptr

# Set keyboard repeat rate.
xset r rate 200 60

# If Emacs is started in server mode, `emacsclient` is a convenient way to
# edit files in place (used by e.g. `git commit`).
export VISUAL=emacsclient
export EDITOR="$VISUAL"

# Finally launch emacs.
exec dbus-launch --exit-with-session emacs
</pre>
</div>
</div>
</div>
<div id="outline-container-org9d45183" class="outline-2">
<h2 id="org9d45183"><span class="section-number-2">3</span> Keybindings</h2>
<div class="outline-text-2" id="text-3">
<p>
These are my preferred keybindings
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd "C-x C-F") 'find-file-at-point)
(global-set-key (kbd "C-x p p") 'project-switch-open-project)
(global-set-key (kbd "C-x p f") 'project-find-file)
(global-set-key (kbd "C-x p b") 'project-switch-to-buffer)
(global-set-key (kbd "C-x p k") 'project-kill-buffers)

(defcustom mm/meta-prefix "C-." "mm/meta prefix")
(global-set-key (kbd mm/meta-prefix) nil)
(defun mm/meta-set-key (keystroke)
  "Set keystroke mm prefixed"
  (kbd (concat mm/meta-prefix " " keystroke)))

(global-set-key (mm/meta-set-key "b") 'ibuffer)
(global-set-key (mm/meta-set-key "h") '(lambda () (interactive)
                                         (find-file "~/.emacs.d/emacs.org")))
(global-set-key (mm/meta-set-key "i m") 'imenu)
(global-set-key (mm/meta-set-key "i b") 'ibuffer)
(global-set-key (mm/meta-set-key "o a") 'org-agenda)
(global-set-key (mm/meta-set-key "o c") 'org-capture)
(global-set-key (mm/meta-set-key "e s") 'sh-send-line-or-region-and-step)
(global-set-key (mm/meta-set-key "e e") 'eshell)
(global-set-key (mm/meta-set-key "w") 'eww)
</pre>
</div>
</div>

<div id="outline-container-org8eac3ad" class="outline-3">
<h3 id="org8eac3ad"><span class="section-number-3">3.1</span> Meta-key</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Wants to take advantage of the meta key (i.e. <code>CMD</code> on MacOS, or
<code>Win</code> on Windows) to set some useful shortcuts, <a href="#orgbf78212">trying to preserve the vanilla emacs muscle memory</a>. So <code>s-0</code> for <code>C-x 0</code>, <code>s-3</code> for <code>C-x 3</code> and so on..
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd "s-c") 'kill-ring-save)
(global-set-key (kbd "s-1") 'delete-other-windows)
(global-set-key (kbd "s-3") 'split-window-horizontally)
(global-set-key (kbd "s-2") 'split-window-vertically)
(global-set-key (kbd "s-0") 'delete-window)
(global-set-key (kbd "s-w") 'other-window)
(global-set-key (kbd "s-W") '(lambda () (interactive)
                               (other-window 1) (maximize-window)))
(global-set-key (kbd "s-r") 'repeat)
(global-set-key (kbd "s-K") 'switch-to-buffer)
(global-set-key (kbd "s-p") 'project-switch-to-buffer)
(global-set-key (kbd "s-P") 'project-find-file)
(global-set-key (kbd "s-t") 'eshell)
(global-set-key (kbd "s-[") 'previous-buffer)
(global-set-key (kbd "s-]") 'next-buffer)
(global-set-key (kbd "s--") 'bookmark-bmenu-list)
(global-set-key (kbd "s-_") 'bookmark-set)
(global-set-key (kbd "s-\\") 'other-frame)
(global-set-key (kbd "s-N") 'dired-jump)
(global-set-key (kbd "s-DEL") 'zap-up-to-char)
(global-set-key (kbd "s-=") 'balance-windows)
(global-set-key (kbd "s-)") 'kill-this-buffer)
</pre>
</div>

<p>
Override <code>isearch-mode-map</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key isearch-mode-map (kbd "C-p") 'isearch-repeat-backward)
(define-key isearch-mode-map (kbd "C-n") 'isearch-repeat-forward)
(define-key isearch-mode-map (kbd "&lt;tab&gt;") 'isearch-repeat-backward)
(define-key isearch-mode-map (kbd "&lt;S-tab&gt;") 'isearch-repeat-forward)
</pre>
</div>

<p>
Add shortcut in translation map which basically are fast access to <code>C-x</code> and <code>C-c</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key key-translation-map (kbd "s-k") (kbd "M-x"))
(define-key key-translation-map (kbd "s-m") (kbd "C-x"))
(define-key key-translation-map (kbd "s-M") (kbd "C-c"))
(define-key key-translation-map (kbd "s-o") (kbd mm/meta-prefix))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org08623be" class="outline-2">
<h2 id="org08623be"><span class="section-number-2">4</span> No meta (alt)?</h2>
<div class="outline-text-2" id="text-4">
<p>
For some reason you can't use the <code>alt</code> key on your keyboard? (It happens to me with Iterm + ssh + emacsclient session) and for some reason you don't want to solve this issue configuring Iterm or else? In this case you use this workaround, remapping some core keybinding like <code>C-k</code> and <code>C-l</code>.
</p>

<pre class="example" id="org3ebbaf6">
(global-set-key (kbd "C-k") 'execute-extended-command)
(global-set-key (kbd "C-K") 'kill-visual-line)
(global-set-key (kbd "C-l") 'god-local-mode)
(global-set-key (kbd "C-L") 'recenter-top-bottom)
</pre>
</div>
<div id="outline-container-orgcf3e751" class="outline-3">
<h3 id="orgcf3e751"><span class="section-number-3">4.1</span> Editing</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd "C-; C-k") 'zap-up-to-char)
(global-set-key (kbd "C-; C-;") 'dabbrev-expand)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7bb9241" class="outline-3">
<h3 id="org7bb9241"><span class="section-number-3">4.2</span> Autocompletion</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org3361bf3" class="outline-4">
<h4 id="org3361bf3"><span class="section-number-4">4.2.1</span> Company</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
A basic auto-completion package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package company
  :config
  (global-company-mode))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb941f4f" class="outline-3">
<h3 id="orgb941f4f"><span class="section-number-3">4.3</span> Highlight and markers</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(show-paren-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org64cd9b9" class="outline-3">
<h3 id="org64cd9b9"><span class="section-number-3">4.4</span> Parenthesis</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rainbow-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeac90c0" class="outline-3">
<h3 id="orgeac90c0"><span class="section-number-3">4.5</span> Expand region</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package expand-region
  :bind
  ("s-l" . er/expand-region))
</pre>
</div>

<p>
Used in tandem with
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(pending-delete-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc31fbb" class="outline-3">
<h3 id="orgdc31fbb"><span class="section-number-3">4.6</span> Navigation</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-orge573420" class="outline-4">
<h4 id="orge573420"><span class="section-number-4">4.6.1</span> Jumping around</h4>
<div class="outline-text-4" id="text-4-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ace-jump-mode
  :config
  (global-set-key (kbd "s-j") 'ace-jump-word-mode))
</pre>
</div>
</div>
</div>
</div>
</div>
