emacs.org
* Interactive

Here we define main packages and customizations concerning the interaction of the user with Emacs, basically the way inputs are prompted and selected. Here we offers also links for unused setup, but is here if you just want to experiment. Ido is the buil-in method, Ivy and Helm are valid alternatives.

** Completion styles
   #+begin_src emacs-lisp
(setq completion-styles '(substring initials flex partial-completion orderless))
(setq completion-category-overrides
            '((buffer (styles . (substring)))
              (file (styles . (initials orderless)))
              (project-file (styles . (initials orderless)))))
     ;; ;; (setq completion-flex-nospace t)
     ;; ;; (setq read-buffer-completion-ignore-case t)
     ;; (setq read-file-name-completion-ignore-case t)
     ;; (setq completion-show-help t)
     ;; (setq completion-auto-help t)
#+end_src
** Minibuffer
   #+begin_src emacs-lisp
     (define-key minibuffer-local-completion-map (kbd "<C-return>") 'minibuffer-force-complete-and-exit)
     (define-key minibuffer-local-completion-map (kbd "C-j") 'minibuffer-force-complete-and-exit)
     ;(define-key minibuffer-local-completion-map (kbd "<tab>") 'minibuffer-force-complete)
     (define-key minibuffer-local-completion-map (kbd "C-c") 'switch-to-completions)
     (define-key minibuffer-local-completion-map (kbd "C-o") 'switch-to-completions)
     #+end_src

** Icomplete
#+begin_src emacs-lisp
  (use-package icomplete
    :config
    (icomplete-mode nil)
    :bind
    (:map minibuffer-local-completion-map
          ("C-p" . icomplete-backward-completions)
          ("C-N" . icomplete-forward-completions)
          ("C-j" . icomplete-force-complete-and-exit)
          ("<C-return>" . icomplete-force-complete-and-exit)))
#+end_src

*** Vertical mode (should be built-in in Emacs >= 28)

#+begin_src emacs-lisp
  (use-package icomplete-vertical
    :config
    (icomplete-vertical-mode 1))
#+end_src

** Save history
   #+begin_src emacs-lisp
     (use-package savehist
       :init
       (savehist-mode))
   #+end_src
** Embark
   #+begin_src emacs-lisp
     (use-package embark
       :bind*
       ("C-," . embark-act))
   #+end_src
** Marginalia
   #+begin_src emacs-lisp
     (use-package marginalia
       :init
       (marginalia-mode 1))
   #+end_src
** Which key

#+begin_src emacs-lisp
(use-package which-key :config (which-key-mode t))
#+end_src

** God mode

#+begin_quote
NOTE: Emacs 25.1 is required for this package to work well.


This is a global minor mode for entering Emacs commands without modifier keys. It's similar to Vim's separation of command mode and insert mode.

All existing key bindings will work in God mode. It's only there to reduce your usage of modifier keys.
#+end_quote

[[https://github.com/emacsorphanage/god-mode][God-mode]] aims to ease keychord immision. You can easily switch it on/off via ~s-n~ shortcut. I use took inspiration from [[https://www.vim.org][vim]], so when in god-mode you can just hit ~i~ (to deactivate god-mode, something resembling the activation of /insert/ mode in vim) or ~u~ for /undo.

#+begin_src emacs-lisp
  (use-package god-mode
    :config
    (god-mode)
    (which-key-enable-god-mode-support)
    (global-set-key (kbd "s-n") 'god-local-mode)
    (define-key god-local-mode-map (kbd "i") 'god-local-mode)
    (define-key god-local-mode-map (kbd "u") 'undo)
    (define-key god-local-mode-map (kbd "U") 'keyboard-quit)
    (define-key god-local-mode-map (kbd ".") 'repeat)
    (define-key god-local-mode-map (kbd ">") 'end-of-buffer)
    (define-key god-local-mode-map (kbd "<") 'beginning-of-buffer)

    (setq god-exempt-major-modes (append god-exempt-major-modes '(
								  elfeed-search-mode
								  elfeed-show-mode
								  erc-mode
								  vterm-mode
								  )))

    (defun mm/god-mode-enabled ()
      (setq mm/god-mode-status 1)
      (setq cursor-type 'box))
    (defun mm/god-mode-disabled ()
      (setq mm/god-mode-status nil)
      (setq cursor-type 'bar))
    (add-hook 'god-mode-enabled-hook 'mm/god-mode-enabled)
    (add-hook 'god-mode-disabled-hook 'mm/god-mode-disabled))
#+end_src

* Versioning
** Magit

#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :config
    (transient-append-suffix 'magit-rebase "-d" '("-D" "Ingore date" "--ignore-date"))
    (transient-append-suffix 'magit-cherry-pick "-e" '("-n" "No commit" "--no-commit"))
    (global-set-key (kbd "C-x g") 'magit-status
                    ))
#+end_src

* Major modes
** Elisp

Main customizations for programming in ~elisp~.

#+begin_src emacs-lisp :tangle no
  (define-key emacs-lisp-mode-map (kbd "s-j") 'eval-print-last-sexp)
#+end_src

** Ruby

#+begin_src emacs-lisp
(use-package enh-ruby-mode)
(use-package rinari)
(use-package rspec-mode)
(use-package rvm)
(use-package bundler)
#+end_src

** Elixir
#+begin_src emacs-lisp
(use-package alchemist)
#+end_src
** Web

#+begin_src emacs-lisp
    (use-package web-mode
      :config
      (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
      (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
      (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
      (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
      (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
      (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
      (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
      :custom
      (web-mode-enable-auto-indentation . nil))
#+end_src

Fast HTML typing with [[https://github.com/smihica/emmet-mode][Emmet-mode]].

#+begin_src emacs-lisp
  (use-package emmet-mode
    :config
    (add-hook 'sgml-mode-hook 'emmet-mode)
    (add-hook 'html-mode-hook 'emmet-mode)
    (add-hook 'web-mode-hook 'emmet-mode)
    (add-hook 'css-mode-hook  'emmet-mode))

#+end_src
** Markup
*** YAML
#+begin_src emacs-lisp
(use-package yaml-mode)
#+end_src
