emacs.html
<div id="outline-container-org62a79af" class="outline-2">
<h2 id="org62a79af"><span class="section-number-2">5</span> Interactive</h2>
<div class="outline-text-2" id="text-5">
<p>
Here we define main packages and customizations concerning the interaction of the user with Emacs, basically the way inputs are prompted and selected. Here we offers also links for unused setup, but is here if you just want to experiment. Ido is the buil-in method, Ivy and Helm are valid alternatives.
</p>
</div>

<div id="outline-container-orgd4d250b" class="outline-3">
<h3 id="orgd4d250b"><span class="section-number-3">5.1</span> Completion styles</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq completion-styles '(substring initials flex partial-completion orderless))
(setq completion-category-overrides
            '((buffer (styles . (substring)))
              (file (styles . (initials orderless)))
              (project-file (styles . (initials orderless)))))
     ;; ;; (setq completion-flex-nospace t)
     ;; ;; (setq read-buffer-completion-ignore-case t)
     ;; (setq read-file-name-completion-ignore-case t)
     ;; (setq completion-show-help t)
     ;; (setq completion-auto-help t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c7057c" class="outline-3">
<h3 id="org7c7057c"><span class="section-number-3">5.2</span> Minibuffer</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key minibuffer-local-completion-map (kbd "&lt;C-return&gt;") 'minibuffer-force-complete-and-exit)
(define-key minibuffer-local-completion-map (kbd "C-j") 'minibuffer-force-complete-and-exit)
;(define-key minibuffer-local-completion-map (kbd "&lt;tab&gt;") 'minibuffer-force-complete)
(define-key minibuffer-local-completion-map (kbd "C-c") 'switch-to-completions)
(define-key minibuffer-local-completion-map (kbd "C-o") 'switch-to-completions)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3b5359a" class="outline-3">
<h3 id="org3b5359a"><span class="section-number-3">5.3</span> Icomplete</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package icomplete
  :config
  (icomplete-mode nil)
  :bind
  (:map minibuffer-local-completion-map
        ("C-p" . icomplete-backward-completions)
        ("C-N" . icomplete-forward-completions)
        ("C-j" . icomplete-force-complete-and-exit)
        ("&lt;C-return&gt;" . icomplete-force-complete-and-exit)))
</pre>
</div>
</div>

<div id="outline-container-orga60eac4" class="outline-4">
<h4 id="orga60eac4"><span class="section-number-4">5.3.1</span> Vertical mode (should be built-in in Emacs &gt;= 28)</h4>
<div class="outline-text-4" id="text-5-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package icomplete-vertical
  :config
  (icomplete-vertical-mode 1))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1894214" class="outline-3">
<h3 id="org1894214"><span class="section-number-3">5.4</span> Save history</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package savehist
  :init
  (savehist-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6081fff" class="outline-3">
<h3 id="org6081fff"><span class="section-number-3">5.5</span> Embark</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package embark
  :bind*
  ("C-," . embark-act))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgca5ca98" class="outline-3">
<h3 id="orgca5ca98"><span class="section-number-3">5.6</span> Marginalia</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package marginalia
  :init
  (marginalia-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org34def5e" class="outline-3">
<h3 id="org34def5e"><span class="section-number-3">5.7</span> Which key</h3>
<div class="outline-text-3" id="text-5-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package which-key :config (which-key-mode t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0aa0407" class="outline-3">
<h3 id="org0aa0407"><span class="section-number-3">5.8</span> God mode</h3>
<div class="outline-text-3" id="text-5-8">
<blockquote>
<p>
NOTE: Emacs 25.1 is required for this package to work well.
</p>


<p>
This is a global minor mode for entering Emacs commands without modifier keys. It's similar to Vim's separation of command mode and insert mode.
</p>

<p>
All existing key bindings will work in God mode. It's only there to reduce your usage of modifier keys.
</p>
</blockquote>

<p>
<a href="https://github.com/emacsorphanage/god-mode">God-mode</a> aims to ease keychord immision. You can easily switch it on/off via <code>s-n</code> shortcut. I use took inspiration from <a href="https://www.vim.org">vim</a>, so when in god-mode you can just hit <code>i</code> (to deactivate god-mode, something resembling the activation of <i>insert</i> mode in vim) or <code>u</code> for /undo.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package god-mode
  :config
  (god-mode)
  (which-key-enable-god-mode-support)
  (global-set-key (kbd "s-n") 'god-local-mode)
  (define-key god-local-mode-map (kbd "i") 'god-local-mode)
  (define-key god-local-mode-map (kbd "u") 'undo)
  (define-key god-local-mode-map (kbd "U") 'keyboard-quit)
  (define-key god-local-mode-map (kbd ".") 'repeat)
  (define-key god-local-mode-map (kbd "&gt;") 'end-of-buffer)
  (define-key god-local-mode-map (kbd "&lt;") 'beginning-of-buffer)

  (setq god-exempt-major-modes (append god-exempt-major-modes '(
								elfeed-search-mode
								elfeed-show-mode
								erc-mode
								vterm-mode
								)))

  (defun mm/god-mode-enabled ()
    (setq mm/god-mode-status 1)
    (setq cursor-type 'box))
  (defun mm/god-mode-disabled ()
    (setq mm/god-mode-status nil)
    (setq cursor-type 'bar))
  (add-hook 'god-mode-enabled-hook 'mm/god-mode-enabled)
  (add-hook 'god-mode-disabled-hook 'mm/god-mode-disabled))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8aa348e" class="outline-2">
<h2 id="org8aa348e"><span class="section-number-2">6</span> Versioning</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgf2408cf" class="outline-3">
<h3 id="orgf2408cf"><span class="section-number-3">6.1</span> Magit</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package magit
  :ensure t
  :config
  (transient-append-suffix 'magit-rebase "-d" '("-D" "Ingore date" "--ignore-date"))
  (transient-append-suffix 'magit-cherry-pick "-e" '("-n" "No commit" "--no-commit"))
  (global-set-key (kbd "C-x g") 'magit-status
                  ))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf681ce4" class="outline-2">
<h2 id="orgf681ce4"><span class="section-number-2">7</span> Major modes</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgfa1dade" class="outline-3">
<h3 id="orgfa1dade"><span class="section-number-3">7.1</span> Elisp</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Main customizations for programming in <code>elisp</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key emacs-lisp-mode-map (kbd "s-j") 'eval-print-last-sexp)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb983e1a" class="outline-3">
<h3 id="orgb983e1a"><span class="section-number-3">7.2</span> Ruby</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package enh-ruby-mode)
(use-package rinari)
(use-package rspec-mode)
(use-package rvm)
(use-package bundler)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc8299ee" class="outline-3">
<h3 id="orgc8299ee"><span class="section-number-3">7.3</span> Elixir</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package alchemist)
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ff1b5a" class="outline-3">
<h3 id="org2ff1b5a"><span class="section-number-3">7.4</span> Web</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package web-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
  :custom
  (web-mode-enable-auto-indentation . nil))
</pre>
</div>

<p>
Fast HTML typing with <a href="https://github.com/smihica/emmet-mode">Emmet-mode</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emmet-mode
  :config
  (add-hook 'sgml-mode-hook 'emmet-mode)
  (add-hook 'html-mode-hook 'emmet-mode)
  (add-hook 'web-mode-hook 'emmet-mode)
  (add-hook 'css-mode-hook  'emmet-mode))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb662f98" class="outline-3">
<h3 id="orgb662f98"><span class="section-number-3">7.5</span> Markup</h3>
<div class="outline-text-3" id="text-7-5">
</div>
<div id="outline-container-orga3de4e3" class="outline-4">
<h4 id="orga3de4e3"><span class="section-number-4">7.5.1</span> YAML</h4>
<div class="outline-text-4" id="text-7-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package yaml-mode)
</pre>
</div>
</div>
</div>
</div>
</div>
