emacs.org
** COMMENT LSP mode
#+begin_src emacs-lisp
(use-package lsp-mode
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
;;  (setq lsp-keymap-prefix "C-c l")
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
         (XXX-mode . lsp)
         ;; if you want which-key integration
         (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp)

;; optionally
(use-package lsp-ui :commands lsp-ui-mode)
;; if you are helm user
(use-package helm-lsp :commands helm-lsp-workspace-symbol)
;; if you are ivy user
;;(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
;;(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

;; optionally if you want to use debugger
(use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language
#+end_src

* Org-mode

#+begin_src emacs-lisp
  (use-package org
    :bind
    (:map org-mode-map
	  ("M-p" . org-move-subtree-up)
	  ("M-n" . org-move-subtree-down))
    :config
    (add-to-list 'org-file-apps '(directory . emacs)))
#+end_src
*** Org-babel
**** Org src executions

     #+begin_src emacs-lisp
       (org-babel-do-load-languages 'org-babel-load-languages '(
								(shell . t)
(eshell .t)
								)
				    )
     #+end_src

** Beautify Org-mode

Beautify ~org-mode~ with bullets..

#+begin_src emacs-lisp
(use-package org-bullets
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src

...and the mighty ~Olivetti~ mode!

#+begin_src emacs-lisp
(use-package olivetti
  :config
  (add-hook 'org-mode-hook 'olivetti-mode))
#+end_src

** Agenda

#+begin_src emacs-lisp
  (use-package org
    :custom
    (org-directory "~/Dropbox/org/")
    (org-agenda-files '("~/Dropbox/org/"))
    (org-default-notes-file "~/Dropbox/org/notes.org"))
#+end_src

Here a quick snippet to customize your [[https://orgmode.org/manual/Capture-templates.html][org capture templates]] (taken from [[http://www.howardism.org/Technical/Emacs/capturing-intro.html][www.howardism.org]]) and [[https://www.reddit.com/r/emacs/comments/7zqc7b/share_your_org_capture_templates/][here a reddit thread of shared org capture templates]].

#+begin_example emacs-lisp
 (add-to-list '(org-capture-templates
   '(("p" "Personal stuff")
     ("pt" "Scheduled task" entry
      (file+headline "~/Dropbox/org/notes.org" "Tasks")
      "** TODO %?\n%^t\n%i" :empty-lines 1)
     ("pn" "Note" entry
      (file "~/Dropbox/org/notes.org")
      "* %?\n%i"))))
#+end_example

*** Org capture

   Here's [[https://www.youtube.com/watch?v=qCdScs4YO8k&t=15s][Prot video]] about Org capture templates.
   

*** Alert

#+begin_src emacs-lisp
(use-package org-alert)
#+end_src
** COMMENT <<Blogging>>

[[org-mode]] has a built-in blogging feature under the ~ox-publish~
module. If you want to know more about Org-mode publishers,
[[https://orgmode.org/worg/exporters/ox-overview.html][check here]]. And here the fantastic blog of [[https://ag91.github.io/][ag91]] which use [[https://github.com/kelvinh/org-page][org-page]].

#+begin_src emacs-lisp :results output none :tangle no
  (require 'ox-publish)
  (let ((org-export-babel-evaluate nil)
	(org-publish-project-alist
	 '(("org-files"
	    :base-directory "./"
	    :base-extension "org"
	    :publishing-directory "~/site"
	    :recursive t
	    :publishing-function org-html-publish-to-html
	    :export-babel-evaluate nil
	    :headline-levels 4
	    :with-toc nil)
	   ("assets"
	    :base-directory "./assets/"
	    :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
	    :publishing-directory "~/site/assets/"
	    :recursive t
	    :publishing-function org-publish-attachment)
	   ("site" :components ("org-files" "assets")))))
    (org-publish "site"))
#+end_src

*** Autopublishing script.

#+begin_src emacs-lisp :results output none :tangle no
  (let* ((remote "git@github.com:MinasMazar/minasmazar.github.io.git")
	(commit-msg (concat "'Autopublish [" (current-time-string) "]'"))
	(out (shell-command-to-string "git remote"))
	(repo-p (string-match "fatal" out)))
    (cd "~/site")
    (unless repo-p (progn 
		     (shell-command "git init")
		     (shell-command (concat "git remote add origin " remote))))
    (shell-command "git add .")
    (shell-command (concat "git commit -m " commit-msg))
    (shell-command "git push origin master"))
#+end_src

* Applications
** Eww ~ web browser

#+begin_src emacs-lisp
  (use-package eww)

#+end_src

** Terminal emulators

Vterm imo is something you want if you need the most OS/temrinal like experience within emacs. It relies on vetrm libraries on your host system, which means to install this if you have MacOS/homeberw just

#+begin_src shell :tangle no :results output none
brew install libvterm
#+end_src

#+begin_src emacs-lisp
  (use-package vterm
    :init
    (defun vterm-or-create (&optional last-cmd)
      "Open *vterm* buffer if present, create a new one if none"
      (interactive "p")
      (vterm)
      (when (eq last-cmd 0)
        (progn
          (vterm-send-up)
          (vterm-send-return))))
    (defun vterm-send-last-cmd ()
      (interactive)
      (vterm-send-up)
      (vterm-send-return))
    :bind
    ("s-T" . vterm-or-create))
#+end_src

You can use vterm to spawn different processes

#+begin_example emacs-lisp
  #+begin_src emacs-lisp
    (with-current-buffer (vterm "*web-server*")
      (vterm-send-string "PORT=5000 bin/rails\n"))
    (with-current-buffer (vterm "*webpack-server*")
      (vterm-send-string "bin/webpack-dev-server \n"))
#+end_example

#+end_src
** Bongo
#+begin_src emacs-lisp
(use-package bongo)
#+end_src
** Try!

[[https://github.com/larstvei/Try][Try]] permits to one-shot try for some packages.

#+begin_src emacs-lisp
(use-package try)
#+end_src

**Here goes a list of packages that will be installed in a try version...**
** Networking
*** RESTClient
Restclient is a really useful tool, basically an emacs interface to ~curl~.

#+begin_src emacs-lisp
(use-package restclient)
(use-package ob-restclient
  :after org-mode)
#+end_src

Here an example of usage:

#+begin_example
# Set variables form elisp code using :=
:token := reaper-api-key
:account-id := reaper-account-id
:auth-headers = <<
User-Agent: curl
Authorization: Bearer :token
Harvest-Account-ID: :account-id
Content-Type: application/json
#

# Make API request to Harvest app
GET https://api.harvestapp.com/v2/users/me
:auth-headers
#+end_example

If you want your Emacs to interact to Harvest, you can use Reaper package!
** COMMENT News and RSS
*** Elfeed

#+begin_src emacs-lisp
  (use-package elfeed
    :config
    (add-to-list 'elfeed-feeds '(
				 "https://www.reddit.com/r/slackware/.rss"
				 "https://static.fsf.org/fsforg/rss/news.xml" . "open-source")))
#+end_src

    #+end_src

If you want to schedule RSS updates you can do something like:

#+begin_example emacs-lisp
  (run-at-time 10 (* 60 5) 'elfeed-update)
#+end_example

**** TODO Retrieve all Youtube feeds from your "channels" page

If you have a channel with this url ~https://www.youtube.com/channel/ID-OF-THE-CHANNEL~ the RSS feed for this channel will be ~https://www.youtube.com/feeds/videos.xml?channel_id=ID-OF-THE-CHANNEL~.
Here's a function to easy cast those urls.

#+begin_src emacs-lisp
  (defun mm/yt/channel-url-to-rss-url (&optional url)
    "Cast a Youtube channel URL to a RSS feed one"
    (interactive "sChannel URL: ")
    ;https://www.youtube.com/feeds/videos.xml?channel_id={ID}
    (message url))
#+end_src

* Mail
