emacs.html
<div id="outline-container-orgf78e986" class="outline-2">
<h2 id="orgf78e986"><span class="section-number-2">8</span> Org-mode</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org
  :bind
  (:map org-mode-map
	("M-p" . org-move-subtree-up)
	("M-n" . org-move-subtree-down))
  :config
  (add-to-list 'org-file-apps '(directory . emacs)))
</pre>
</div>
</div>
<div id="outline-container-org1fcc92d" class="outline-4">
<h4 id="org1fcc92d"><span class="section-number-4">8.0.1</span> Org-babel</h4>
<div class="outline-text-4" id="text-8-0-1">
</div>
<div id="outline-container-org3c0f2c4" class="outline-5">
<h5 id="org3c0f2c4"><span class="section-number-5">8.0.1.1</span> Org src executions</h5>
<div class="outline-text-5" id="text-8-0-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">       (org-babel-do-load-languages 'org-babel-load-languages '(
								(shell . t)
(eshell .t)
								)
				    )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgec0f3b5" class="outline-3">
<h3 id="orgec0f3b5"><span class="section-number-3">8.1</span> Beautify Org-mode</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Beautify <code>org-mode</code> with bullets..
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-bullets
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
</pre>
</div>

<p>
&#x2026;and the mighty <code>Olivetti</code> mode!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package olivetti
  :config
  (add-hook 'org-mode-hook 'olivetti-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org026e20d" class="outline-3">
<h3 id="org026e20d"><span class="section-number-3">8.2</span> Agenda</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org
  :custom
  (org-directory "~/Dropbox/org/")
  (org-agenda-files '("~/Dropbox/org/"))
  (org-default-notes-file "~/Dropbox/org/notes.org"))
</pre>
</div>

<p>
Here a quick snippet to customize your <a href="https://orgmode.org/manual/Capture-templates.html">org capture templates</a> (taken from <a href="http://www.howardism.org/Technical/Emacs/capturing-intro.html">www.howardism.org</a>) and <a href="https://www.reddit.com/r/emacs/comments/7zqc7b/share_your_org_capture_templates/">here a reddit thread of shared org capture templates</a>.
</p>

<pre class="example" id="org2c03bef">
(add-to-list '(org-capture-templates
  '(("p" "Personal stuff")
    ("pt" "Scheduled task" entry
     (file+headline "~/Dropbox/org/notes.org" "Tasks")
     "** TODO %?\n%^t\n%i" :empty-lines 1)
    ("pn" "Note" entry
     (file "~/Dropbox/org/notes.org")
     "* %?\n%i"))))
</pre>
</div>

<div id="outline-container-orgb28d075" class="outline-4">
<h4 id="orgb28d075"><span class="section-number-4">8.2.1</span> Org capture</h4>
<div class="outline-text-4" id="text-8-2-1">
<p>
Here's <a href="https://www.youtube.com/watch?v=qCdScs4YO8k&amp;t=15s">Prot video</a> about Org capture templates.
</p>
</div>
</div>


<div id="outline-container-org1c6d6bb" class="outline-4">
<h4 id="org1c6d6bb"><span class="section-number-4">8.2.2</span> Alert</h4>
<div class="outline-text-4" id="text-8-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-alert)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org9adf136" class="outline-2">
<h2 id="org9adf136"><span class="section-number-2">9</span> Applications</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgbb62f48" class="outline-3">
<h3 id="orgbb62f48"><span class="section-number-3">9.1</span> Eww ~ web browser</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package eww)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgdfb8385" class="outline-3">
<h3 id="orgdfb8385"><span class="section-number-3">9.2</span> Terminal emulators</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Vterm imo is something you want if you need the most OS/temrinal like experience within emacs. It relies on vetrm libraries on your host system, which means to install this if you have MacOS/homeberw just
</p>

<div class="org-src-container">
<pre class="src src-shell">brew install libvterm
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vterm
  :init
  (defun vterm-or-create (&amp;optional last-cmd)
    "Open *vterm* buffer if present, create a new one if none"
    (interactive "p")
    (vterm)
    (when (eq last-cmd 0)
      (progn
        (vterm-send-up)
        (vterm-send-return))))
  (defun vterm-send-last-cmd ()
    (interactive)
    (vterm-send-up)
    (vterm-send-return))
  :bind
  ("s-T" . vterm-or-create))
</pre>
</div>

<p>
You can use vterm to spawn different processes
</p>

<pre class="example" id="orga27a073">
#+begin_src emacs-lisp
  (with-current-buffer (vterm "*web-server*")
    (vterm-send-string "PORT=5000 bin/rails\n"))
  (with-current-buffer (vterm "*webpack-server*")
    (vterm-send-string "bin/webpack-dev-server \n"))
</pre>

<p>
#+end<sub>src</sub>
</p>
</div>
</div>
<div id="outline-container-orge6f8269" class="outline-3">
<h3 id="orge6f8269"><span class="section-number-3">9.3</span> Bongo</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package bongo)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1b7fbbd" class="outline-3">
<h3 id="org1b7fbbd"><span class="section-number-3">9.4</span> Try!</h3>
<div class="outline-text-3" id="text-9-4">
<p>
<a href="https://github.com/larstvei/Try">Try</a> permits to one-shot try for some packages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package try)
</pre>
</div>

<p>
<b><b>Here goes a list of packages that will be installed in a try version&#x2026;</b></b>
</p>
</div>
</div>
<div id="outline-container-org1ac11e7" class="outline-3">
<h3 id="org1ac11e7"><span class="section-number-3">9.5</span> Networking</h3>
<div class="outline-text-3" id="text-9-5">
</div>
<div id="outline-container-org4129ca2" class="outline-4">
<h4 id="org4129ca2"><span class="section-number-4">9.5.1</span> RESTClient</h4>
<div class="outline-text-4" id="text-9-5-1">
<p>
Restclient is a really useful tool, basically an emacs interface to <code>curl</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package restclient)
(use-package ob-restclient
  :after org-mode)
</pre>
</div>

<p>
Here an example of usage:
</p>

<pre class="example" id="org92d7261">
# Set variables form elisp code using :=
:token := reaper-api-key
:account-id := reaper-account-id
:auth-headers = &lt;&lt;
User-Agent: curl
Authorization: Bearer :token
Harvest-Account-ID: :account-id
Content-Type: application/json
#

# Make API request to Harvest app
GET https://api.harvestapp.com/v2/users/me
:auth-headers
</pre>

<p>
If you want your Emacs to interact to Harvest, you can use Reaper package!
</p>
</div>
</div>
</div>
</div>
