emacs.org
** [[http://www.offlineimap.org/][offlineimap]]

You can use Emacs as your mail client. In order to configure ~mu4e~ I'm following [[https://gist.github.com/areina/3879626][this useful gist]].
In order to let ~offlineimap~ to read your authfile, you must save this snippet into your ~~/.offlineimap.py~

#+BEGIN_EXAMPLE python
#!/usr/bin/python

import re, os

def get_password_emacs(machine, login, port):
    s = "machine %s login %s password ([^ ]*) port %s\n" % (machine, login, port)
    p = re.compile(s)
    authinfo = os.popen("gpg -q --no-tty -d ~/.authinfo.gpg").read()
    return p.search(authinfo).group(1)
#+END_EXAMPLE

and take care to add this entry to your ~~/.offlineimaprc~

#+BEGIN_EXAMPLE python
pythonfile = ~/.offlineimap.py
#+END_EXAMPLE

A normal ~~/.authfile.gpg~ with some entries for IMAP/SMTP account should be like this.

#+begin_example
machine imap.gmail.com login your-email@example.com password your-strong-password port imaps
machine imap.gmail.com login your-email@example.com password your-strong-password port 587
machine smtp.gmail.com login your-email@example.com password your-strong-password port 465
#+end_example

This is an example of an ~~/.offlineimaprc~ config file for a Gmail email account with the inclusion of ~offlineimap.py~ defined above.

#+begin_example
[general]
accounts = Gmail
maxsyncaccounts = 1
pythonfile = ~/.offlineimap.py

[Account Gmail]
localrepository = Local
remoterepository = Remote

[Repository Local]
type = Maildir
localfolders = ~/Maildir

[Repository Remote]
type = Gmail
remoteuser = your-email@gmail.com
remotepasseval = get_password_emacs("imap.gmail.com", "your-email@gmail.com", "993")
realdelete = no

folderfilter = lambda foldername: foldername not in ['[Gmail]/Spam', '[Gmail]/All Mail', '[Gmail]/Starred', '[Gmail]/Important']

holdconnectionopen = true
keepalive = 60
sslcacertfile = /etc/ssl/certs/ca-certificates.crt
#+end_example

If you don't have a certificate you can generate via

#+begin_src sh
sudo mkcert -cert-file /etc/ssl/certs/ca-certificates.crt localhost
#+end_src

** [[https://www.djcbsoftware.nl/code/mu/mu4e.html][Mu4e]]

   Useful resources could be found [[https://www.djcbsoftware.nl/code/mu/mu4e/Gmail-configuration.html][here]].

Here we can't simply ~(use-package mu4e)~. On MacOS I've just soft-linked the ~/usr/local/Cellar/mu/1.4.15/share/emacs/site-lisp/mu/mu4e~
to ~~/.emacs.d/mu4e~.

Consider ~offlineimap~ could invoke indexing of ~mu~ (so setting the
~mu-binary~ could results in multiple invocations). Also the ~-o~ flag ("invoke once")
is required because otherwise it will stay active in background.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/mu4e/")
  (require 'mu4e)
  (setq mu4e-update-interval (* 60 10)
	mu4e-mu-binary "/usr/local/bin/mu"
	mu4e-get-mail-command "/usr/local/bin/offlineimap -o"
	message-kill-buffer-on-exit t)

#+END_SRC

Sample setup of mu4e

#+begin_example emacs-lisp
(setq
   user-mail-address "USERNAME@gmail.com"
   user-full-name  "YOUR FULL NAME")
#+end_example

Here a sample configuration for SMTP

#+begin_example emacs-lisp
  (setq message-send-mail-function 'smtpmail-send-it
	smtpmail-stream-type 'starttls
	smtpmail-smtp-server "smtp.example.com"
	smtpmail-smtp-service 465
	smtpmail-stream-type 'ssl)
#+end_example

* Custom functions

Here I define some useful functions for daily use.

#+begin_src emacs-lisp
  (defun mm/yt-download (url &optional audio-only)
    "Download youtube video givin a URL"
    (interactive "sURL: ")
    (let* ((outbuff (format "*yt-download-%s*" url))
	  (audio-only (if current-prefix-arg current-prefix-arg 0))
	  (audio-only (if (< audio-only 0) "--extract-audio --audio-format mp3" ""))
	  (cmd (format "youtube-dl %s \"%s\"" audio-only url))
	  )
      (async-shell-command cmd outbuff)))
#+end_src

Now you can invoke the function and a URL will be asked.
* Private settings

I want to save my personal/private configuration into a separate,
private, not versioned file.

#+begin_src emacs-lisp
  (defvar mm/custom-file "~/.emacs.d/private.el"
    "My custom-not-versioned-private file")

  (if (file-exists-p mm/custom-file)
      (load mm/custom-file)
    (shell-command (format "touch %s" mm/custom-file)))
#+end_src

* EPG/GPG

This setting enables Emacs to ask pinentry via minibuffer.

#+begin_src emacs-lisp
(setq epa-pinentry-mode 'loopback)
#+end_src

* Appearance and theme
** COMMENT Tango dark
I load Tango dark by default

#+begin_src emacs-lisp
(load-theme 'tango-dark)
#+end_src

** COMMENT Modus vivendi (optional)

If you want the mighty [[https://protesilaos.com/modus-themes/][Modus Vivendi theme]] installed by default, uncomment this entry.

#+begin_src emacs-lisp
(use-package modus-vivendi-theme
  :config
  (load-theme 'modus-vivendi))
#+end_src

If you want a light mode, choose [[elisp:(call-interactively 'load-theme)][one of the list]] ;)

** Font size and zoom

You can customize default font face [[elisp:(customize-face 'default)][at runtime]].

If you save the configuration, you will find an entry like the next in
your ~init.el~ and can be runtime evaluated.

#+begin_example emacs-lisp
  (custom-set-faces
    ;; custom-set-faces was added by Custom.
    ;; If you edit it by hand, you could mess it up, so be careful.
    ;; Your init file should contain only one such instance.
    ;; If there is more than one, they won't work right.
    '(default ((t (:height 220)))))
#+end_example

** Modeline

Add an indicator of whether the God mode is active or not. First of all we should define a function that return a G if god-mode is active or an empy string if not.

#+begin_src emacs-lisp
(defun mm/mode-line-god-mode-indicator ()
   (if mm/god-mode-status " *G* " "i "))
#+end_src

Now add an entry to ~mode-line-format~ with something like

#+begin_src emacs-lisp
  (use-package emacs
    :config
    (add-to-list 'mode-line-format
		 '(:eval (mm/mode-line-god-mode-indicator))))
#+end_src

** Window rules
#+begin_example emacs-lisp
  (add-to-list 'display-buffer-alist '("\\*Help\\*"
					(display-buffer-in-side-window)
					(window-height . 0.25)
					(side . bottom)
					(slot . -1)))
  (add-to-list 'display-buffer-alist '("\\*Buffer List\\*"
					(display-buffer-in-side-window)
					(window-width . 0.25)
					(side . right)
					(sloq . -1)))
  (add-to-list 'display-buffer-alist '("dev.org"
					(display-buffer-in-side-window)
					(window-width . 0.35)
					(side . right)
					(sloq . -1)))
#+end_example
