emacs.html
<div id="outline-container-org88c2286" class="outline-2">
<h2 id="org88c2286"><span class="section-number-2">10</span> Mail</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgeb7918f" class="outline-3">
<h3 id="orgeb7918f"><span class="section-number-3">10.1</span> <a href="http://www.offlineimap.org/">offlineimap</a></h3>
<div class="outline-text-3" id="text-10-1">
<p>
You can use Emacs as your mail client. In order to configure <code>mu4e</code> I'm following <a href="https://gist.github.com/areina/3879626">this useful gist</a>.
In order to let <code>offlineimap</code> to read your authfile, you must save this snippet into your <code>~/.offlineimap.py</code>
</p>

<pre class="example" id="orgbdf93c2">
#!/usr/bin/python

import re, os

def get_password_emacs(machine, login, port):
    s = "machine %s login %s password ([^ ]*) port %s\n" % (machine, login, port)
    p = re.compile(s)
    authinfo = os.popen("gpg -q --no-tty -d ~/.authinfo.gpg").read()
    return p.search(authinfo).group(1)
</pre>

<p>
and take care to add this entry to your <code>~/.offlineimaprc</code>
</p>

<pre class="example" id="org4fe68a4">
pythonfile = ~/.offlineimap.py
</pre>

<p>
A normal <code>~/.authfile.gpg</code> with some entries for IMAP/SMTP account should be like this.
</p>

<pre class="example" id="org3d7a1d9">
machine imap.gmail.com login your-email@example.com password your-strong-password port imaps
machine imap.gmail.com login your-email@example.com password your-strong-password port 587
machine smtp.gmail.com login your-email@example.com password your-strong-password port 465
</pre>

<p>
This is an example of an <code>~/.offlineimaprc</code> config file for a Gmail email account with the inclusion of <code>offlineimap.py</code> defined above.
</p>

<pre class="example" id="org9b7c9ee">
[general]
accounts = Gmail
maxsyncaccounts = 1
pythonfile = ~/.offlineimap.py

[Account Gmail]
localrepository = Local
remoterepository = Remote

[Repository Local]
type = Maildir
localfolders = ~/Maildir

[Repository Remote]
type = Gmail
remoteuser = your-email@gmail.com
remotepasseval = get_password_emacs("imap.gmail.com", "your-email@gmail.com", "993")
realdelete = no

folderfilter = lambda foldername: foldername not in ['[Gmail]/Spam', '[Gmail]/All Mail', '[Gmail]/Starred', '[Gmail]/Important']

holdconnectionopen = true
keepalive = 60
sslcacertfile = /etc/ssl/certs/ca-certificates.crt
</pre>

<p>
If you don't have a certificate you can generate via
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo mkcert -cert-file /etc/ssl/certs/ca-certificates.crt localhost
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc878eff" class="outline-3">
<h3 id="orgc878eff"><span class="section-number-3">10.2</span> <a href="https://www.djcbsoftware.nl/code/mu/mu4e.html">Mu4e</a></h3>
<div class="outline-text-3" id="text-10-2">
<p>
Useful resources could be found <a href="https://www.djcbsoftware.nl/code/mu/mu4e/Gmail-configuration.html">here</a>.
</p>

<p>
Here we can't simply <code>(use-package mu4e)</code>. On MacOS I've just soft-linked the <code>/usr/local/Cellar/mu/1.4.15/share/emacs/site-lisp/mu/mu4e</code>
to <code>~/.emacs.d/mu4e</code>.
</p>

<p>
Consider <code>offlineimap</code> could invoke indexing of <code>mu</code> (so setting the
<code>mu-binary</code> could results in multiple invocations). Also the <code>-o</code> flag ("invoke once")
is required because otherwise it will stay active in background.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path "~/.emacs.d/mu4e/")
(require 'mu4e)
(setq mu4e-update-interval (* 60 10)
      mu4e-mu-binary "/usr/local/bin/mu"
      mu4e-get-mail-command "/usr/local/bin/offlineimap -o"
      message-kill-buffer-on-exit t)

</pre>
</div>

<p>
Sample setup of mu4e
</p>

<pre class="example" id="orgaff6e0b">
(setq
   user-mail-address "USERNAME@gmail.com"
   user-full-name  "YOUR FULL NAME")
</pre>

<p>
Here a sample configuration for SMTP
</p>

<pre class="example" id="orgd427908">
(setq message-send-mail-function 'smtpmail-send-it
      smtpmail-stream-type 'starttls
      smtpmail-smtp-server "smtp.example.com"
      smtpmail-smtp-service 465
      smtpmail-stream-type 'ssl)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd71ecdf" class="outline-2">
<h2 id="orgd71ecdf"><span class="section-number-2">11</span> Custom functions</h2>
<div class="outline-text-2" id="text-11">
<p>
Here I define some useful functions for daily use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun mm/yt-download (url &amp;optional audio-only)
  "Download youtube video givin a URL"
  (interactive "sURL: ")
  (let* ((outbuff (format "*yt-download-%s*" url))
	(audio-only (if current-prefix-arg current-prefix-arg 0))
	(audio-only (if (&lt; audio-only 0) "--extract-audio --audio-format mp3" ""))
	(cmd (format "youtube-dl %s \"%s\"" audio-only url))
	)
    (async-shell-command cmd outbuff)))
</pre>
</div>

<p>
Now you can invoke the function and a URL will be asked.
</p>
</div>
</div>
<div id="outline-container-org66ef9da" class="outline-2">
<h2 id="org66ef9da"><span class="section-number-2">12</span> Private settings</h2>
<div class="outline-text-2" id="text-12">
<p>
I want to save my personal/private configuration into a separate,
private, not versioned file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar mm/custom-file "~/.emacs.d/private.el"
  "My custom-not-versioned-private file")

(if (file-exists-p mm/custom-file)
    (load mm/custom-file)
  (shell-command (format "touch %s" mm/custom-file)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1001bf" class="outline-2">
<h2 id="orge1001bf"><span class="section-number-2">13</span> EPG/GPG</h2>
<div class="outline-text-2" id="text-13">
<p>
This setting enables Emacs to ask pinentry via minibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq epa-pinentry-mode 'loopback)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f8599e" class="outline-2">
<h2 id="org6f8599e"><span class="section-number-2">14</span> Appearance and theme</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org6064410" class="outline-3">
<h3 id="org6064410"><span class="section-number-3">14.1</span> Font size and zoom</h3>
<div class="outline-text-3" id="text-14-1">
<p>
You can customize default font face <a href="(customize-face 'default)">at runtime</a>.
</p>

<p>
If you save the configuration, you will find an entry like the next in
your <code>init.el</code> and can be runtime evaluated.
</p>

<pre class="example" id="orgf048d04">
(custom-set-faces
  ;; custom-set-faces was added by Custom.
  ;; If you edit it by hand, you could mess it up, so be careful.
  ;; Your init file should contain only one such instance.
  ;; If there is more than one, they won't work right.
  '(default ((t (:height 220)))))
</pre>
</div>
</div>

<div id="outline-container-orgf553da0" class="outline-3">
<h3 id="orgf553da0"><span class="section-number-3">14.2</span> Modeline</h3>
<div class="outline-text-3" id="text-14-2">
<p>
Add an indicator of whether the God mode is active or not. First of all we should define a function that return a G if god-mode is active or an empy string if not.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun mm/mode-line-god-mode-indicator ()
   (if mm/god-mode-status " *G* " "i "))
</pre>
</div>

<p>
Now add an entry to <code>mode-line-format</code> with something like
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emacs
  :config
  (add-to-list 'mode-line-format
	       '(:eval (mm/mode-line-god-mode-indicator))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga780833" class="outline-3">
<h3 id="orga780833"><span class="section-number-3">14.3</span> Window rules</h3>
<div class="outline-text-3" id="text-14-3">
<pre class="example" id="orgfca0e85">
(add-to-list 'display-buffer-alist '("\\*Help\\*"
				      (display-buffer-in-side-window)
				      (window-height . 0.25)
				      (side . bottom)
				      (slot . -1)))
(add-to-list 'display-buffer-alist '("\\*Buffer List\\*"
				      (display-buffer-in-side-window)
				      (window-width . 0.25)
				      (side . right)
				      (sloq . -1)))
(add-to-list 'display-buffer-alist '("dev.org"
				      (display-buffer-in-side-window)
				      (window-width . 0.35)
				      (side . right)
				      (sloq . -1)))
</pre>
</div>
</div>
