emacs.org
** Initial buffer (<<Homepage>>)

Emacs startup. You can easily customize ~initial-buffer-choice~
variable. I suggest you to set it as your /homepage/ kinda an
index/entry point or place where you usually start to think about my
daily work activities. It could be your *org-agenda* index, like [[file:emacs-home-page.org][this
example org-homepage]]. Consider it mapped on the pretty handy ~s-h~ shortcut.

#+begin_src emacs-lisp
  (global-set-key (kbd "s-h") '(lambda () (interactive)
				 (find-file initial-buffer-choice)))
#+end_src

** Dired

Easy copy to another dired buffer.. one of the killer feature of dired!

#+begin_src emacs-lisp
  (setq dired-dwim-target t)
  (add-hook 'dired-mode-hook #'dired-hide-details-mode)
#+end_src

Avoid opening many dired buffers.

#+begin_src emacs-lisp
  (use-package dired-single
    :after dired
    :bind
    (:map dired-mode-map (
                           ("RET" . 'dired-single-buffer)
                           ("s-N" . 'dired-single-up-directory)
                           )))
#+end_src

Dired subtree

#+begin_src emacs-lisp
  (use-package dired-subtree
    :after dired
    :bind
    (:map dired-mode-map ("<tab>" . dired-subtree-toggle)))

#+end_src
** Browser

Configure which broswer opens urls according to a match list. This is just an example (comment out to enable).

Define some customs for binary and arguments, like done for other browsers.

#+begin_src emacs-lisp
  (defcustom browse-url-opera-program "" "Opera executable")
  (defcustom browse-url-opera-arguments "opera" "Opera executable arguments")
  (setq browse-url-opera-arguments ())
#+end_src

Experimental.

#+begin_example emacs-lisp
(defun browse-url-ask (&optional browser url)
  (interactive "CBrowser: \n")
  (call-interactively browser url))
#+end_example
** [[https://www.opera.com/][Opera]] support

Define ~browse-url-opera~.

#+begin_src emacs-lisp
  (defun browse-url-opera (url &optional _new-window)
    "Ask the Opera WWW browser to load URL.
  Default to the URL around or before point.  The strings in
  variable `browse-url-opera-arguments' are also passed to
  Opera.
  The optional argument NEW-WINDOW is not used."
    (interactive (browse-url-interactive-arg "URL: "))
    (setq url (browse-url-encode-url url))
    (let* ((process-environment (browse-url-process-environment)))
      (apply 'start-process
	     (concat "opera " url) nil
	     browse-url-opera-program
	     (append
	      browse-url-opera-arguments
	      (list url)))))
#+end_src

This is an example mappging from ~url~ => ~browser~.

#+begin_example emacs-lisp
(setq browse-url-browser-function '(
				    ("twitter.com" . browse-url-opera)
				    ("github.com" . browse-url-chrome)
				    ("reddit.com" . eww-browse-url)
				    ("." . eww-browse-url)))

#+end_example
* Learning Emacs
** Regular Expression Syntax

Here is the syntax used by Emacs for regular expressions. Any character matches itself, except for the list below.

The following characters are special : . * + ? ^ $ \ [

Between brackets [], the following are special : ] - ^

Many characters are special when they follow a backslash – see below.

  .        any character (but newline)
  *        previous character or group, repeated 0 or more time
  +        previous character or group, repeated 1 or more time
  ?        previous character or group, repeated 0 or 1 time
  ^        start of line
  $        end of line
  [...]    any character between brackets
  [^..]    any character not in the brackets
  [a-z]    any character between a and z
  \        prevents interpretation of following special char
  \|       or
  \w       word constituent
  \b       word boundary
  \sc      character with c syntax (e.g. \s- for whitespace char)
  \( \)    start\end of group
  \< \>    start\end of word
  \_< \_>  start\end of symbol
  \` \'    start\end of buffer\string
  \1       string matched by the first group
  \n       string matched by the nth group
  \{3\}    previous character or group, repeated 3 times
  \{3,\}   previous character or group, repeated 3 or more times
  \{3,6\}  previous character or group, repeated 3 to 6 times
  \=       match succeeds if it is located at point
*?, +?, and ?? are non-greedy versions of *, +, and ? – see NonGreedyRegexp. Also, \W, \B, and \Sc match any character that does not match \w, \b, and \sc.

Characters are organized by category. Use C-u C-x = to display the category of the character under the cursor.

  \ca      ascii character
  \Ca      non-ascii character (newline included)
  \cl      latin character
  \cg      greek character
Here are some syntax classes that can be used between brackets, e.g. [[:upper:]\|[:digit:]\.].

  [:digit:]  a digit, same as [0-9]
  [:alpha:]  a letter (an alphabetic character)
  [:alnum:]  a letter or adigit (an alphanumeric character ()
  [:upper:]  a letter in uppercase
  [:space:]  a whitespace character, as defined by the syntax table
  [:xdigit:] an hexadecimal digit
  [:cntrl:]  a control character
  [:ascii:]  an ascii character
Syntax classes:

  \s-   whitespace character        \s/   character quote character
  \sw   word constituent            \s$   paired delimiter
  \s_   symbol constituent          \s'   expression prefix
  \s.   punctuation character       \s<   comment starter
  \s(   open delimiter character    \s>   comment ender
  \s)   close delimiter character   \s!   generic comment delimiter
  \s"   string quote character      \s|   generic string delimiter
  \s\   escape character

** Vectors
Get an element from a vector
#+BEGIN_SRC emacs-lisp
;; get a element from vector
(aref ["a" "b" "c"] 0) ; ⇒ "a"
;; get a element from vector
(elt ["a" "b" "c"] 0) ; ⇒ "a"
#+END_SRC
What's the difference between =aref= and =elt=?
=elt= is more general. It works on vector and list. But if you know
it's vector, you should use =aref=, because it's precise and faster.
** Timers
You can run specified function at specified time and with a specific timeout! Check out [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Timers.html][the doc]] for more information.

#+BEGIN_QUOTE
The list-timers command lists all the currently active timers. There’s
only one command available in the buffer displayed: c
(timer-list-cancel) that will cancel the timer on the line under
point.
#+END_QUOTE
