emacs.html
<div id="outline-container-org5664918" class="outline-3">
<h3 id="org5664918"><span class="section-number-3">14.4</span> Initial buffer (<a id="org619e0b4"></a>)</h3>
<div class="outline-text-3" id="text-14-4">
<p>
Emacs startup. You can easily customize <code>initial-buffer-choice</code>
variable. I suggest you to set it as your <i>homepage</i> kinda an
index/entry point or place where you usually start to think about my
daily work activities. It could be your <b>org-agenda</b> index, like <a href="emacs-home-page.html">this
example org-homepage</a>. Consider it mapped on the pretty handy <code>s-h</code> shortcut.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd "s-h") '(lambda () (interactive)
			       (find-file initial-buffer-choice)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd98c45" class="outline-3">
<h3 id="orgcd98c45"><span class="section-number-3">14.5</span> Dired</h3>
<div class="outline-text-3" id="text-14-5">
<p>
Easy copy to another dired buffer.. one of the killer feature of dired!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq dired-dwim-target t)
(add-hook 'dired-mode-hook #'dired-hide-details-mode)
</pre>
</div>

<p>
Avoid opening many dired buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dired-single
  :after dired
  :bind
  (:map dired-mode-map (
                         ("RET" . 'dired-single-buffer)
                         ("s-N" . 'dired-single-up-directory)
                         )))
</pre>
</div>

<p>
Dired subtree
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dired-subtree
  :after dired
  :bind
  (:map dired-mode-map ("&lt;tab&gt;" . dired-subtree-toggle)))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb972cce" class="outline-3">
<h3 id="orgb972cce"><span class="section-number-3">14.6</span> Browser</h3>
<div class="outline-text-3" id="text-14-6">
<p>
Configure which broswer opens urls according to a match list. This is just an example (comment out to enable).
</p>

<p>
Define some customs for binary and arguments, like done for other browsers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom browse-url-opera-program "" "Opera executable")
(defcustom browse-url-opera-arguments "opera" "Opera executable arguments")
(setq browse-url-opera-arguments ())
</pre>
</div>

<p>
Experimental.
</p>

<pre class="example" id="orgd00ded2">
(defun browse-url-ask (&amp;optional browser url)
  (interactive "CBrowser: \n")
  (call-interactively browser url))
</pre>
</div>
</div>
<div id="outline-container-orgc5b0093" class="outline-3">
<h3 id="orgc5b0093"><span class="section-number-3">14.7</span> <a href="https://www.opera.com/">Opera</a> support</h3>
<div class="outline-text-3" id="text-14-7">
<p>
Define <code>browse-url-opera</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun browse-url-opera (url &amp;optional _new-window)
  "Ask the Opera WWW browser to load URL.
Default to the URL around or before point.  The strings in
variable `browse-url-opera-arguments' are also passed to
Opera.
The optional argument NEW-WINDOW is not used."
  (interactive (browse-url-interactive-arg "URL: "))
  (setq url (browse-url-encode-url url))
  (let* ((process-environment (browse-url-process-environment)))
    (apply 'start-process
	   (concat "opera " url) nil
	   browse-url-opera-program
	   (append
	    browse-url-opera-arguments
	    (list url)))))
</pre>
</div>

<p>
This is an example mappging from <code>url</code> =&gt; <code>browser</code>.
</p>

<pre class="example" id="org8e29d47">
(setq browse-url-browser-function '(
				    ("twitter.com" . browse-url-opera)
				    ("github.com" . browse-url-chrome)
				    ("reddit.com" . eww-browse-url)
				    ("." . eww-browse-url)))

</pre>
</div>
</div>
</div>
<div id="outline-container-org595c700" class="outline-2">
<h2 id="org595c700"><span class="section-number-2">15</span> Learning Emacs</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orge0de6fe" class="outline-3">
<h3 id="orge0de6fe"><span class="section-number-3">15.1</span> Regular Expression Syntax</h3>
<div class="outline-text-3" id="text-15-1">
<p>
Here is the syntax used by Emacs for regular expressions. Any character matches itself, except for the list below.
</p>

<p>
The following characters are special : . * + ? ^ $ \ [
</p>

<p>
Between brackets [], the following are special : ] - ^
</p>

<p>
Many characters are special when they follow a backslash – see below.
</p>

<p>
.        any character (but newline)
</p>
<ul class="org-ul">
<li>previous character or group, repeated 0 or more time</li>
<li>previous character or group, repeated 1 or more time</li>
</ul>
<p>
  ?        previous character or group, repeated 0 or 1 time
  ^        start of line
  $        end of line
  [&#x2026;]    any character between brackets
  [^..]    any character not in the brackets
  [a-z]    any character between a and z
  \        prevents interpretation of following special char
  \|       or
  \w       word constituent
  \b       word boundary
  \sc      character with c syntax (e.g. \s- for whitespace char)
  \( \)    start\end of group
  \&lt; \&gt;    start\end of word
  \_&lt; \_&gt;  start\end of symbol
  \` \'    start\end of buffer\string
  \1       string matched by the first group
  \n       string matched by the nth group
  \{3\}    previous character or group, repeated 3 times
  \{3,\}   previous character or group, repeated 3 or more times
  \{3,6\}  previous character or group, repeated 3 to 6 times
  \=       match succeeds if it is located at point
*?, +?, and ?? are non-greedy versions of *, +, and ? – see NonGreedyRegexp. Also, \W, \B, and \Sc match any character that does not match \w, \b, and \sc.
</p>

<p>
Characters are organized by category. Use C-u C-x = to display the category of the character under the cursor.
</p>

<p>
  \ca      ascii character
  \Ca      non-ascii character (newline included)
  \cl      latin character
  \cg      greek character
Here are some syntax classes that can be used between brackets, e.g. [[:upper:]\|[:digit:]\.].
</p>

<p>
  [:digit:]  a digit, same as [0-9]
  [:alpha:]  a letter (an alphabetic character)
  [:alnum:]  a letter or adigit (an alphanumeric character ()
  [:upper:]  a letter in uppercase
  [:space:]  a whitespace character, as defined by the syntax table
  [:xdigit:] an hexadecimal digit
  [:cntrl:]  a control character
  [:ascii:]  an ascii character
Syntax classes:
</p>

<p>
\s-   whitespace character        \s/   character quote character
\sw   word constituent            \s$   paired delimiter
\s_   symbol constituent          \s'   expression prefix
\s.   punctuation character       \s&lt;   comment starter
\s(   open delimiter character    \s&gt;   comment ender
\s)   close delimiter character   \s!   generic comment delimiter
\s"   string quote character      \s|   generic string delimiter
\s\   escape character
</p>
</div>
</div>

<div id="outline-container-org069a977" class="outline-3">
<h3 id="org069a977"><span class="section-number-3">15.2</span> Vectors</h3>
<div class="outline-text-3" id="text-15-2">
<p>
Get an element from a vector
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; get a element from vector
(aref ["a" "b" "c"] 0) ; ⇒ "a"
;; get a element from vector
(elt ["a" "b" "c"] 0) ; ⇒ "a"
</pre>
</div>
<p>
What's the difference between <code>aref</code> and <code>elt</code>?
<code>elt</code> is more general. It works on vector and list. But if you know
it's vector, you should use <code>aref</code>, because it's precise and faster.
</p>
</div>
</div>
<div id="outline-container-org8e51899" class="outline-3">
<h3 id="org8e51899"><span class="section-number-3">15.3</span> Timers</h3>
<div class="outline-text-3" id="text-15-3">
<p>
You can run specified function at specified time and with a specific timeout! Check out <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Timers.html">the doc</a> for more information.
</p>

<blockquote>
<p>
The list-timers command lists all the currently active timers. There’s
only one command available in the buffer displayed: c
(timer-list-cancel) that will cancel the timer on the line under
point.
</p>
</blockquote>
</div>
</div>
</div>
